RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_SIUL2.h
#define SIUL2_GPDI184_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI184_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI184_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI184_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI184_PDI_n_SHIFT)) & SIUL2_GPDI184_PDI_n_MASK)
/*! @} */

/*! @name GPDI191 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI191_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI191_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI191_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI191_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI191_PDI_n_SHIFT)) & SIUL2_GPDI191_PDI_n_MASK)
/*! @} */

/*! @name GPDI190 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI190_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI190_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI190_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI190_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI190_PDI_n_SHIFT)) & SIUL2_GPDI190_PDI_n_MASK)
/*! @} */

/*! @name GPDI189 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI189_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI189_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI189_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI189_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI189_PDI_n_SHIFT)) & SIUL2_GPDI189_PDI_n_MASK)
/*! @} */

/*! @name GPDI188 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI188_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI188_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI188_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI188_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI188_PDI_n_SHIFT)) & SIUL2_GPDI188_PDI_n_MASK)
/*! @} */

/*! @name GPDI195 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI195_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI195_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI195_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI195_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI195_PDI_n_SHIFT)) & SIUL2_GPDI195_PDI_n_MASK)
/*! @} */

/*! @name GPDI194 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI194_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI194_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI194_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI194_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI194_PDI_n_SHIFT)) & SIUL2_GPDI194_PDI_n_MASK)
/*! @} */

/*! @name GPDI193 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI193_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI193_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI193_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI193_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI193_PDI_n_SHIFT)) & SIUL2_GPDI193_PDI_n_MASK)
/*! @} */

/*! @name GPDI192 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI192_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI192_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI192_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI192_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI192_PDI_n_SHIFT)) & SIUL2_GPDI192_PDI_n_MASK)
/*! @} */

/*! @name GPDI199 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI199_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI199_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI199_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI199_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI199_PDI_n_SHIFT)) & SIUL2_GPDI199_PDI_n_MASK)
/*! @} */

/*! @name GPDI198 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI198_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI198_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI198_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI198_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI198_PDI_n_SHIFT)) & SIUL2_GPDI198_PDI_n_MASK)
/*! @} */

/*! @name GPDI197 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI197_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI197_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI197_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI197_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI197_PDI_n_SHIFT)) & SIUL2_GPDI197_PDI_n_MASK)
/*! @} */

/*! @name GPDI196 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI196_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI196_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI196_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI196_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI196_PDI_n_SHIFT)) & SIUL2_GPDI196_PDI_n_MASK)
/*! @} */

/*! @name GPDI203 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI203_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI203_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI203_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI203_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI203_PDI_n_SHIFT)) & SIUL2_GPDI203_PDI_n_MASK)
/*! @} */

/*! @name GPDI202 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI202_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI202_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI202_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI202_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI202_PDI_n_SHIFT)) & SIUL2_GPDI202_PDI_n_MASK)
/*! @} */

/*! @name GPDI201 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

#define SIUL2_GPDI201_PDI_n_MASK                 (0x1U)
#define SIUL2_GPDI201_PDI_n_SHIFT                (0U)
#define SIUL2_GPDI201_PDI_n_WIDTH                (1U)
#define SIUL2_GPDI201_PDI_n(x)                   (((uint8_t)(((uint8_t)(x)) << SIUL2_GPDI201_PDI_n_SHIFT)) & SIUL2_GPDI201_PDI_n_MASK)
/*! @} */

/*! @name GPDI200 - SIUL2 GPIO Pad Data Input Register */
/*! @{ */

