RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_SIUL2.h
#define SIUL2_PGPDO10_PPDO5_MASK                 (0x20U)
#define SIUL2_PGPDO10_PPDO5_SHIFT                (5U)
#define SIUL2_PGPDO10_PPDO5_WIDTH                (1U)
#define SIUL2_PGPDO10_PPDO5(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO5_SHIFT)) & SIUL2_PGPDO10_PPDO5_MASK)

#define SIUL2_PGPDO10_PPDO6_MASK                 (0x40U)
#define SIUL2_PGPDO10_PPDO6_SHIFT                (6U)
#define SIUL2_PGPDO10_PPDO6_WIDTH                (1U)
#define SIUL2_PGPDO10_PPDO6(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO6_SHIFT)) & SIUL2_PGPDO10_PPDO6_MASK)

#define SIUL2_PGPDO10_PPDO7_MASK                 (0x80U)
#define SIUL2_PGPDO10_PPDO7_SHIFT                (7U)
#define SIUL2_PGPDO10_PPDO7_WIDTH                (1U)
#define SIUL2_PGPDO10_PPDO7(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO7_SHIFT)) & SIUL2_PGPDO10_PPDO7_MASK)

#define SIUL2_PGPDO10_PPDO8_MASK                 (0x100U)
#define SIUL2_PGPDO10_PPDO8_SHIFT                (8U)
#define SIUL2_PGPDO10_PPDO8_WIDTH                (1U)
#define SIUL2_PGPDO10_PPDO8(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO8_SHIFT)) & SIUL2_PGPDO10_PPDO8_MASK)

#define SIUL2_PGPDO10_PPDO9_MASK                 (0x200U)
#define SIUL2_PGPDO10_PPDO9_SHIFT                (9U)
#define SIUL2_PGPDO10_PPDO9_WIDTH                (1U)
#define SIUL2_PGPDO10_PPDO9(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO9_SHIFT)) & SIUL2_PGPDO10_PPDO9_MASK)

#define SIUL2_PGPDO10_PPDO10_MASK                (0x400U)
#define SIUL2_PGPDO10_PPDO10_SHIFT               (10U)
#define SIUL2_PGPDO10_PPDO10_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO10_SHIFT)) & SIUL2_PGPDO10_PPDO10_MASK)

#define SIUL2_PGPDO10_PPDO11_MASK                (0x800U)
#define SIUL2_PGPDO10_PPDO11_SHIFT               (11U)
#define SIUL2_PGPDO10_PPDO11_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO11_SHIFT)) & SIUL2_PGPDO10_PPDO11_MASK)

#define SIUL2_PGPDO10_PPDO12_MASK                (0x1000U)
#define SIUL2_PGPDO10_PPDO12_SHIFT               (12U)
#define SIUL2_PGPDO10_PPDO12_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO12_SHIFT)) & SIUL2_PGPDO10_PPDO12_MASK)

#define SIUL2_PGPDO10_PPDO13_MASK                (0x2000U)
#define SIUL2_PGPDO10_PPDO13_SHIFT               (13U)
#define SIUL2_PGPDO10_PPDO13_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO13_SHIFT)) & SIUL2_PGPDO10_PPDO13_MASK)

#define SIUL2_PGPDO10_PPDO14_MASK                (0x4000U)
#define SIUL2_PGPDO10_PPDO14_SHIFT               (14U)
#define SIUL2_PGPDO10_PPDO14_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO14_SHIFT)) & SIUL2_PGPDO10_PPDO14_MASK)

#define SIUL2_PGPDO10_PPDO15_MASK                (0x8000U)
#define SIUL2_PGPDO10_PPDO15_SHIFT               (15U)
#define SIUL2_PGPDO10_PPDO15_WIDTH               (1U)
#define SIUL2_PGPDO10_PPDO15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO10_PPDO15_SHIFT)) & SIUL2_PGPDO10_PPDO15_MASK)
/*! @} */

/*! @name PGPDO13 - SIUL2 Parallel GPIO Pad Data Out Register */
/*! @{ */

#define SIUL2_PGPDO13_PPDO4_MASK                 (0x10U)
#define SIUL2_PGPDO13_PPDO4_SHIFT                (4U)
#define SIUL2_PGPDO13_PPDO4_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO4(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO4_SHIFT)) & SIUL2_PGPDO13_PPDO4_MASK)

#define SIUL2_PGPDO13_PPDO5_MASK                 (0x20U)
#define SIUL2_PGPDO13_PPDO5_SHIFT                (5U)
#define SIUL2_PGPDO13_PPDO5_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO5(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO5_SHIFT)) & SIUL2_PGPDO13_PPDO5_MASK)

#define SIUL2_PGPDO13_PPDO6_MASK                 (0x40U)
#define SIUL2_PGPDO13_PPDO6_SHIFT                (6U)
#define SIUL2_PGPDO13_PPDO6_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO6(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO6_SHIFT)) & SIUL2_PGPDO13_PPDO6_MASK)

#define SIUL2_PGPDO13_PPDO7_MASK                 (0x80U)
#define SIUL2_PGPDO13_PPDO7_SHIFT                (7U)
#define SIUL2_PGPDO13_PPDO7_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO7(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO7_SHIFT)) & SIUL2_PGPDO13_PPDO7_MASK)

#define SIUL2_PGPDO13_PPDO8_MASK                 (0x100U)
#define SIUL2_PGPDO13_PPDO8_SHIFT                (8U)
#define SIUL2_PGPDO13_PPDO8_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO8(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO8_SHIFT)) & SIUL2_PGPDO13_PPDO8_MASK)

#define SIUL2_PGPDO13_PPDO9_MASK                 (0x200U)
#define SIUL2_PGPDO13_PPDO9_SHIFT                (9U)
#define SIUL2_PGPDO13_PPDO9_WIDTH                (1U)
#define SIUL2_PGPDO13_PPDO9(x)                   (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO9_SHIFT)) & SIUL2_PGPDO13_PPDO9_MASK)

#define SIUL2_PGPDO13_PPDO10_MASK                (0x400U)
#define SIUL2_PGPDO13_PPDO10_SHIFT               (10U)
#define SIUL2_PGPDO13_PPDO10_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO10(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO10_SHIFT)) & SIUL2_PGPDO13_PPDO10_MASK)

#define SIUL2_PGPDO13_PPDO11_MASK                (0x800U)
#define SIUL2_PGPDO13_PPDO11_SHIFT               (11U)
#define SIUL2_PGPDO13_PPDO11_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO11(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO11_SHIFT)) & SIUL2_PGPDO13_PPDO11_MASK)

#define SIUL2_PGPDO13_PPDO12_MASK                (0x1000U)
#define SIUL2_PGPDO13_PPDO12_SHIFT               (12U)
#define SIUL2_PGPDO13_PPDO12_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO12(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO12_SHIFT)) & SIUL2_PGPDO13_PPDO12_MASK)

#define SIUL2_PGPDO13_PPDO13_MASK                (0x2000U)
#define SIUL2_PGPDO13_PPDO13_SHIFT               (13U)
#define SIUL2_PGPDO13_PPDO13_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO13(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO13_SHIFT)) & SIUL2_PGPDO13_PPDO13_MASK)

#define SIUL2_PGPDO13_PPDO14_MASK                (0x4000U)
#define SIUL2_PGPDO13_PPDO14_SHIFT               (14U)
#define SIUL2_PGPDO13_PPDO14_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO14(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO14_SHIFT)) & SIUL2_PGPDO13_PPDO14_MASK)

#define SIUL2_PGPDO13_PPDO15_MASK                (0x8000U)
#define SIUL2_PGPDO13_PPDO15_SHIFT               (15U)
#define SIUL2_PGPDO13_PPDO15_WIDTH               (1U)
#define SIUL2_PGPDO13_PPDO15(x)                  (((uint16_t)(((uint16_t)(x)) << SIUL2_PGPDO13_PPDO15_SHIFT)) & SIUL2_PGPDO13_PPDO15_MASK)
/*! @} */

